#### Handling Missing Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data = pd.DataFrame([[1, 6.5, 3], [1, NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3]])

In [9]:
cleaned = data.dropna()

In [10]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [12]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = NA

In [14]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.330518       NaN       NaN
1  0.489488       NaN       NaN
2  0.061996       NaN -1.360723
3  0.249569       NaN -1.129177
4 -0.351557  0.414995  0.047035
5 -1.240963 -0.828318 -0.538848
6  0.649990 -0.332012 -0.517576

In [17]:
df.dropna()

          0         1         2
4 -0.351557  0.414995  0.047035
5 -1.240963 -0.828318 -0.538848
6  0.649990 -0.332012 -0.517576

In [18]:
df.dropna(thresh=3)

          0         1         2
4 -0.351557  0.414995  0.047035
5 -1.240963 -0.828318 -0.538848
6  0.649990 -0.332012 -0.517576

In [19]:
df.fillna(0)

          0         1         2
0  0.330518  0.000000  0.000000
1  0.489488  0.000000  0.000000
2  0.061996  0.000000 -1.360723
3  0.249569  0.000000 -1.129177
4 -0.351557  0.414995  0.047035
5 -1.240963 -0.828318 -0.538848
6  0.649990 -0.332012 -0.517576

In [20]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.330518  0.500000  0.000000
1  0.489488  0.500000  0.000000
2  0.061996  0.500000 -1.360723
3  0.249569  0.500000 -1.129177
4 -0.351557  0.414995  0.047035
5 -1.240963 -0.828318 -0.538848
6  0.649990 -0.332012 -0.517576

In [21]:
_ = df.fillna(0, inplace=True)

In [22]:
df

          0         1         2
0  0.330518  0.000000  0.000000
1  0.489488  0.000000  0.000000
2  0.061996  0.000000 -1.360723
3  0.249569  0.000000 -1.129177
4 -0.351557  0.414995  0.047035
5 -1.240963 -0.828318 -0.538848
6  0.649990 -0.332012 -0.517576

In [23]:
df = pd.DataFrame(np.random.randn(6, 3))

df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.421928 -0.784644 -1.967691
1  0.752520  0.857557  0.290212
2 -2.115890       NaN  0.379431
3  1.622547       NaN  0.222884
4  0.275766       NaN       NaN
5 -0.090038       NaN       NaN

In [24]:
df.fillna(method='ffill')

          0         1         2
0 -0.421928 -0.784644 -1.967691
1  0.752520  0.857557  0.290212
2 -2.115890  0.857557  0.379431
3  1.622547  0.857557  0.222884
4  0.275766  0.857557  0.222884
5 -0.090038  0.857557  0.222884

In [25]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.421928 -0.784644 -1.967691
1  0.752520  0.857557  0.290212
2 -2.115890  0.857557  0.379431
3  1.622547  0.857557  0.222884
4  0.275766       NaN  0.222884
5 -0.090038       NaN  0.222884

In [26]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [27]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

#### Data Transformation

In [28]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [29]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [31]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [32]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [33]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [34]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [35]:
lowercased = data['food'].str.lower()

In [36]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [37]:
data['animal'] = lowercased.map(meat_to_animal)

In [38]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [39]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [40]:
data = pd.Series([1, -999, 2, -999, -1000, 3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [41]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [42]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [43]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [44]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [45]:
transform = lambda x: x[:4].upper()

In [46]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [47]:
data.index = data.index.map(transform)

In [48]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [49]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [50]:
data.rename(index={'OHIO': 'INDIANA'},
           columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [51]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [52]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [53]:
ages = [20, 22, 25, 27, 21, 23, 37, 61, 45, 41, 32]

In [54]:
bins = [18, 25, 35, 60, 100]

In [55]:
cats = pd.cut(ages, bins)

In [56]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (35, 60], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 11
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [57]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 3, 2, 2, 1], dtype=int8)

In [58]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [59]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     2
(60, 100]    1
dtype: int64

In [60]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [35, 60), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 11
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [61]:
group_names = ['Youth', 'YouthAdult', 'MiddleAged', 'Senior']

pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YouthAdult, Youth, ..., MiddleAged, Senior, MiddleAged, MiddleAged, YouthAdult]
Length: 11
Categories (4, object): [Youth < YouthAdult < MiddleAged < Senior]

In [62]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.0029, 0.23], (0.0029, 0.23], (0.45, 0.67], (0.23, 0.45], (0.67, 0.89], ..., (0.67, 0.89], (0.0029, 0.23], (0.23, 0.45], (0.45, 0.67], (0.45, 0.67]]
Length: 20
Categories (4, interval[float64]): [(0.0029, 0.23] < (0.23, 0.45] < (0.45, 0.67] < (0.67, 0.89]]

In [63]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(-0.6, 0.0955], (0.0955, 0.808], (-3.327, -0.6], (0.808, 3.027], (0.808, 3.027], ..., (-3.327, -0.6], (-0.6, 0.0955], (0.0955, 0.808], (0.808, 3.027], (-0.6, 0.0955]]
Length: 1000
Categories (4, interval[float64]): [(-3.327, -0.6] < (-0.6, 0.0955] < (0.0955, 0.808] < (0.808, 3.027]]

In [64]:
pd.value_counts(cats)

(0.808, 3.027]     250
(0.0955, 0.808]    250
(-0.6, 0.0955]     250
(-3.327, -0.6]     250
dtype: int64

In [65]:
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1])
cats

[(-1.216, 0.0955], (0.0955, 1.369], (-1.216, 0.0955], (0.0955, 1.369], (0.0955, 1.369], ..., (-3.327, -1.216], (-1.216, 0.0955], (0.0955, 1.369], (0.0955, 1.369], (-1.216, 0.0955]]
Length: 1000
Categories (4, interval[float64]): [(-3.327, -1.216] < (-1.216, 0.0955] < (0.0955, 1.369] < (1.369, 3.027]]

In [66]:
pd.value_counts(cats)

(0.0955, 1.369]     400
(-1.216, 0.0955]    400
(1.369, 3.027]      100
(-3.327, -1.216]    100
dtype: int64

In [67]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.018527    -0.033008     0.051948    -0.008686
std       0.991318     0.995840     0.996198     1.001906
min      -3.154924    -3.683084    -3.557851    -2.850441
25%      -0.676918    -0.658742    -0.618641    -0.703822
50%      -0.067006    -0.033721     0.064523     0.042744
75%       0.668654     0.619525     0.747109     0.675891
max       2.882913     3.616490     3.043512     3.008264

In [68]:
col = data[2]
col[np.abs(col) > 3]

405   -3.557851
798    3.043512
Name: 2, dtype: float64

In [69]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
108 -0.778143  0.165425  0.108229  3.008264
405 -0.485139  0.086453 -3.557851  0.425189
406 -1.611102 -3.683084 -1.804509 -0.794968
431 -3.063646  0.280744 -0.689466  0.840281
462 -0.135067 -3.156668 -0.214840  1.299436
715  1.462760 -3.000097  0.966320  0.700089
798 -0.545500  0.798740  3.043512  0.296691
836 -3.154924 -0.742997  0.332902  1.499537
928 -0.334366  3.616490 -0.935020  0.273698
935 -3.100315  1.525387 -0.975529  1.219992
953  1.970168  3.132255  0.101621 -0.864334

In [70]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [71]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.018208    -0.032917     0.052462    -0.008694
std       0.990338     0.990592     0.994199     1.001881
min      -3.000000    -3.000000    -3.000000    -2.850441
25%      -0.676918    -0.658742    -0.618641    -0.703822
50%      -0.067006    -0.033721     0.064523     0.042744
75%       0.668654     0.619525     0.747109     0.675891
max       2.882913     3.000000     3.000000     3.000000

In [72]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([2, 0, 4, 3, 1])

In [73]:
df.iloc[sampler]

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7

In [74]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7

In [75]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15

In [76]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

4    4
4    4
3    6
3    6
2   -1
4    4
4    4
3    6
2   -1
0    5
dtype: int64

In [77]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})

In [78]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [79]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [80]:
mnames = ['movie_id', 'title', 'genres']

movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                      header=None, names=mnames)

movies[:10]

/home/trierbo/miniconda2/envs/ml-books/lib/python3.7/site-packages/ipykernel_launcher.py:4: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  after removing the cwd from sys.path.

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [81]:
all_genres = []

for x in movies.genres:
    all_genres.extend(x.split('|'))
    
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [82]:
zero_matrix = np.zeros((len(movies), len(genres)))

dummies = pd.DataFrame(zero_matrix, columns=genres)

In [83]:
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [84]:
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [85]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [86]:
dummies.head()

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [87]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

movies_windic.head()

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,...,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale (1995),Comedy|Drama,0.0,0.0,1.0,0.0,0.0,0.0,1.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II (1995),Comedy,0.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [88]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [89]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

#### String Manipulation

In [90]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [91]:
pieces = [x.strip() for x in val.split(',')]

In [92]:
pieces

['a', 'b', 'guido']

In [93]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [94]:
'::'.join(pieces)

'a::b::guido'

In [95]:
'guido' in val

True

In [96]:
val.index(',')

1

In [97]:
val.find(':')

-1

In [98]:
val.count(',')

2

In [99]:
val = ' abababab '
val.count('abab')

2

In [100]:
val.strip()

'abababab'

In [101]:
val.rstrip()

' abababab'

In [102]:
val.lstrip()

'abababab '

In [103]:
val.ljust(12, '/')

' abababab //'

In [104]:
val.rjust(12, '/')

'// abababab '

In [105]:
import re

text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [106]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [107]:
regex.findall(text)

['    ', '\t ', '  \t']

In [108]:
text = """dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@gmail.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [109]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@gmail.com']

In [110]:
m = regex.search(text)
m

In [111]:
text[m.start():m.end()]

'dave@google.com'

In [112]:
m = regex.match(text)
text[m.start():m.end()]

'dave@google.com'

In [113]:
print(regex.sub('REDACTED', text))

REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [114]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [115]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [116]:
m = regex.match('wesm@bright.net')
m

In [117]:
m.groups()

('wesm', 'bright', 'net')

In [118]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'gmail', 'com')]

In [119]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: gmail, Suffix: com

In [120]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
       'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)

In [121]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [122]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [123]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [124]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [125]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [126]:
data.str.get(1)

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

In [127]:
data.str[:10]

Dave     dave@googl
Steve    steve@gmai
Rob      rob@gmail.
Wes             NaN
dtype: object